{
  "chapter": "CHAPTER TEN—JUDICIARY",
  "sections": [
    {
      "title": "Judicial authority.",
      "articles": [
        {
          "text": "159. (1) Judicial authority is derived from the people and vests in, and shall be exercised by, the courts and tribunals established by or under this Constitution.",
          "sub_articles": [
            "(2) In exercising judicial authority, the courts and tribunals shall be guided by the following principles—",
            "(a) justice shall be done to all, irrespective of status;",
            "(b) justice shall not be delayed;",
            "(c) alternative forms of dispute resolution including reconciliation, mediation, arbitration and traditional dispute resolution mechanisms shall be promoted, subject to clause (3);",
            "(d) justice shall be administered without undue regard to procedural technicalities; and",
            "(e) the purpose and principles of this Constitution shall be protected and promoted.",
            "(3) Traditional dispute resolution mechanisms shall not be used in a way that—",
            "(a) contravenes the Bill of Rights;",
            "(b) is repugnant to justice and morality or results in outcomes that are repugnant to justice or morality; or",
            "(c) is inconsistent with this Constitution or any written law."
          ]
        },
        {
          "title": "Independence of the Judiciary.",
          "text": [
            "160. (1) In the exercise of judicial authority, the Judiciary, as constituted by Article 161, shall be subject only to this Constitution and the law and shall not be subject to the control or direction of any person or authority.",
            "(2) The office of a judge of a superior court shall not be abolished while there is a substantive holder of the office.",
            "(3) The remuneration and benefits payable to or in respect of judges shall be a charge on the Consolidated Fund.",
            "(4) Subject to Article 168(6), the remuneration and benefits payable to, or in respect of, a judge shall not be varied to the disadvantage of that judge, and the retirement benefits of a retired judge shall not be varied to the disadvantage of the retired judge during the lifetime of that retired judge.",
            "(5) A member of the Judiciary is not liable in an action or suit in respect of anything done or omitted to be done in good faith in the lawful performance of a judicial function."
          ]
        },
        {
          "title": "Judicial offices and officers.",
          "text": [
            "161. (1) The Judiciary consists of the judges of the superior courts, magistrates, other judicial officers and staff.",
            "(2) There is established the office of—",
            "(a) Chief Justice, who shall be the Head of the Judiciary;",
            "(b) Deputy Chief Justice, who shall be the Deputy Head of the Judiciary; and",
            "(c) Chief Registrar of the Judiciary, who shall be the chief administrator and accounting officer of the Judiciary.",
            "(3) The Judicial Service Commission may establish other offices of registrar as may be necessary."
          ]
        },
        {
          "title": "System of courts.",
          "text": [
            "162. (1) The superior courts are the Supreme Court, the Court of Appeal, the High Court and the courts referred to in clause (2).",
            "(2) Parliament shall establish courts with the status of the High Court to hear and determine disputes relating to—",
            "(a) employment and labour relations; and",
            "(b) the environment and the use and occupation of, and title to, land.",
            "(3) Parliament shall determine the jurisdiction and functions of the courts contemplated in clause (2).",
            "(4) The subordinate courts are the courts established under Article 169, or by Parliament in accordance with that Article."
          ]
        },
        {
          "title": "Supreme Court.",
          "text": [
            "163. (1) There is established the Supreme Court, which shall consist of—",
            "(a) the Chief Justice, who shall be the president of the court;",
            "(b) the Deputy Chief Justice, who shall—",
            "(i) deputise for the Chief Justice; and",
            "(ii) be the vice-president of the court;",
            "(c) five other judges.",
            "(2) The Supreme Court shall be properly constituted for the purposes of its proceedings if it is composed of five judges.",
            "(3) The Supreme Court shall have—",
            "(a) exclusive original jurisdiction to hear and determine disputes relating to the elections to the office of President arising under Article 140;",
            "(b) subject to clause (4) and (5), appellate jurisdiction to hear and determine appeals from—",
            "(i) the Court of Appeal; and",
            "(ii) any other court or tribunal as prescribed by national legislation.",
            "(4) Appeals shall lie from the Court of Appeal to the Supreme Court—",
            "(a) as of right in any case involving the interpretation or application of this Constitution; and",
            "(b) in any other case in which the Supreme Court, or the Court of Appeal, certifies that a matter of general public importance is involved, subject to clause (5).",
            "(5) A certification by the Court of Appeal under clause (4)(b) may be reviewed by the Supreme Court, and either affirmed, varied or overturned.",
            "(6) The Supreme Court may give an advisory opinion at the request of the national government, any State organ, or any county government with respect to any matter concerning county government.",
            "(7) All courts, other than the Supreme Court, are bound by the decisions of the Supreme Court.",
            "(8) The Supreme Court shall make rules for the exercise of its jurisdiction.",
            "(9) An Act of Parliament may make further provision for the operation of the Supreme Court."
          ]
        },
        {
          "title": "Court of Appeal.",
          "text": [
            "164. (1) There is established the Court of Appeal, which—",
            "(a) shall consist of the number of judges, being not fewer than twelve, as may be prescribed by an Act of Parliament; and",
            "(b) shall be organised and administered in the manner prescribed by an Act of Parliament.",
            "(2) There shall be a president of the Court of Appeal who shall be elected by the judges of the Court of Appeal from among themselves.",
            "(3) The Court of Appeal has jurisdiction to hear appeals from—",
            "(a) the High Court; and",
            "(b) any other court or tribunal as prescribed by an Act of Parliament."
          ]
        },
        {
          "title": "High Court.",
          "text": [
            "165. (1) There is established the High Court, which—",
            "(a) shall consist of the number of judges prescribed by an Act of Parliament; and",
            "(b) shall be organised and administered in the manner prescribed by an Act of Parliament.",
            "(2) There shall be a Principal Judge of the High Court, who shall be elected by the judges of the High Court from among themselves.",
            "(3) Subject to clause (5), the High Court shall have—",
            "(a) unlimited original jurisdiction in criminal and civil matters;",
            "(b) jurisdiction to determine the question whether a right or fundamental freedom in the Bill of Rights has been denied, violated, infringed or threatened;",
            "(c) jurisdiction to hear an appeal from a decision of a tribunal appointed under this Constitution to consider the removal of a person from office, other than a tribunal appointed under Article 144;",
            "(d) jurisdiction to hear any question respecting the interpretation of this Constitution including the determination of—",
            "(i) the question whether any law is inconsistent with or in contravention of this Constitution;",
            "(ii) the question whether anything said to be done under the authority of this Constitution or of any law is inconsistent with, or in contravention of, this Constitution;",
            "(iii) any matter relating to constitutional powers of State organs in respect of county governments and any matter relating to the constitutional relationship between the levels of government; and",
            "(iv) a question relating to conflict of laws under Article 191; and",
            "(e) any other jurisdiction, original or appellate, conferred on it by legislation.",
            "(4) Any matter certified by the court as raising a substantial question of law under clause (3)(b) or (d) shall be heard by an uneven number of judges, being not less than three, assigned by the Chief Justice.",
            "(5) The High Court shall not have jurisdiction in respect of matters—",
            "(a) reserved for the exclusive jurisdiction of the Supreme Court under this Constitution; or",
            "(b) falling within the jurisdiction of the courts contemplated in Article 162(2).",
            "(6) The High Court has supervisory jurisdiction over the subordinate courts and over any person, body or authority exercising a judicial or quasi-judicial function, but not over a superior court.",
            "(7) For the purposes of clause (6), the High Court may call for the record of any proceedings before any subordinate court or person, body or authority referred to in clause (6), and may make any order or give any direction it considers appropriate to ensure the fair administration of justice."
          ]
        },
        {
          "title": "Appointment of Chief Justice, Deputy Chief Justice and other judges.",
          "text": [
            "166. (1) The President shall appoint—",
            "(a) the Chief Justice and the Deputy Chief Justice, in accordance with the recommendation of the Judicial Service Commission, and subject to the approval of the National Assembly; and",
            "(b) all other judges, in accordance with the recommendation of the Judicial Service Commission.",
            "(2) A person shall not be appointed as a judge unless that person is qualified to be appointed as a judge of the High Court.",
            "(3) The qualifications for appointment as a judge of a superior court shall be prescribed by an Act of Parliament."
          ]
        },
        {
          "title": "Judicial Service Commission.",
          "text": [
            "167. (1) There is established the Judicial Service Commission, which consists of—",
            "(a) the Chief Justice, who shall be the chairperson;",
            "(b) the Deputy Chief Justice; and",
            "(c) five other members, who shall be appointed by the President, with the approval of the National Assembly, from among persons recommended by the Law Society of Kenya, the Kenya Magistrates and Judges Association, and the Commission for the Implementation of the Constitution.",
            "(2) The functions of the Judicial Service Commission are to—",
            "(a) promote and facilitate the independence and accountability of the Judiciary;",
            "(b) advise the President and the National Assembly on the appointment and removal of judges;",
            "(c) exercise disciplinary control over the judicial officers; and",
            "(d) perform any other functions prescribed by this Constitution or national legislation."
          ]
        },
        {
          "title": "Interpretation of the Constitution.",
          "text": [
            "168. (1) This Constitution shall be interpreted in a manner that—",
            "(a) promotes its purposes, values and principles;",
            "(b) advances the rule of law, human rights and fundamental freedoms in the Bill of Rights; and",
            "(c) permits the development of the law.",
            "(2) In interpreting this Constitution, a court shall promote the spirit, purport and objects of the Bill of Rights."
          ]
        },
        {
          "title": "Constitutional Commissions and Independent Offices.",
          "text": [
            "169. (1) There shall be established constitutional commissions and independent offices in accordance with Chapter Fifteen.",
            "(2) The commissions and offices established under this Constitution are independent and shall not be subject to the direction or control of any person or authority."
          ]
        }
      ]
    }
  ]
}
