[
  "CHAPTER FIFTEEN—COMMISSIONS AND INDEPENDENT OFFICES",
  [
    [
      "Application of Chapter.",
      [
        "248. (1) This Chapter applies to the commissions specified in clause (2) and the independent offices specified in clause (3), except to the extent that this Constitution provides otherwise.",
        "(2) The commissions are—",
        "(a) the Kenya National Human Rights and Equality Commission;",
        "(b) the National Land Commission;",
        "(c) the Independent Electoral and Boundaries Commission;",
        "(d) the Parliamentary Service Commission;",
        "(e) the Judicial Service Commission;",
        "(f) the Commission on Revenue Allocation;",
        "(g) the Public Service Commission;",
        "(h) the Salaries and Remuneration Commission; ",
        "(i) the Teachers Service Commission; and",
        "(j) the National Police Service Commission.",
        "(3) The independent offices are—",
        "(a) the Auditor-General; and",
        "(b) the Controller of Budget.",
        "Objects, authority and funding of commissions and independent offices."
      ],
      "Objects, authority and funding of commissions and independent offices.",
      [
        "249. (1) The objects of the commissions and the independent offices are to—",
        "(a) protect the sovereignty of the people;",
        "(b) secure the observance by all State organs of democratic values and principles; and",
        "(c) promote constitutionalism.",
        "(2) The commissions and the holders of independent offices—",
        "(a) are subject only to this Constitution and the law; and",
        "(b) are independent and not subject to direction or control by any person or authority.",
        "(3) Parliament shall allocate adequate funds to enable each commission and independent office to perform its functions and the budget of each commission and independent office shall be a separate vote.",
        "Composition, appointment and terms of office."
      ],
      "Composition, appointment and terms of office.",
      [
        "250. (1) Each commission shall consist of at least three, but not more than nine, members.",
        "(2) The chairperson and each member of a commission, and the holder of an independent office, shall be—",
        "(a) identified and recommended for appointment in a manner prescribed by national legislation; ",
        "(b) approved by the National Assembly; and",
        "(c) appointed by the President.",
        "(3) To be appointed, a person shall have the specific qualifications required by this Constitution or national legislation.",
        "(4) Appointments to commissions and independent offices shall take into account the national values referred to in Article 10, and the principle that the composition of the commissions and offices, taken as a whole, shall reflect the regional and ethnic diversity of the people of Kenya.",
        "(5) A member of a commission may serve on a part-time basis.",
        "(6) A member of a commission, or the holder of an independent office—",
        "(a) unless ex officio, shall be appointed for a single term of six years and is not eligible for re-appointment; and",
        "(b) unless ex officio or part-time, shall not hold any other office or employment for profit, whether public or private.",
        "(7) The remuneration and benefits payable to or in respect of a commissioner or the holder of an independent office shall be a charge on the Consolidated Fund.",
        "(8) The remuneration and benefits payable to, or in respect of, a commissioner or the holder of an independent office shall not be varied to the disadvantage of that commissioner or holder of an independent office.",
        "(9) A member of a commission, or the holder of an independent office, is not liable for anything done in good faith in the performance of a function of office.",
        "(10) The members of a commission shall elect a vice-chairperson from among themselves—",
        "(a) at the first sitting of the commission; and",
        "(b) whenever it is necessary to fill a vacancy in the office of the vice-chairperson. ",
        "(11) The chairperson and vice-chairperson of a commission shall not be of the same gender.",
        "(12) There shall be a Secretary to each commission who shall be—",
        "(a) appointed by the commission; and ",
        "(b) the chief executive officer of the commission.",
        "Removal from office."
      ],
      "Removal from office.",
      [
        "251. (1) A member of a commission (other than an ex officio member), or the holder of an independent office, may be removed from office only for—",
        "(a) serious violation of this Constitution or any other law, including a contravention of Chapter Six;",
        "(b) gross misconduct, whether in the performance of the member’s or office holder’s functions or otherwise;",
        "(c) physical or mental incapacity to perform the functions of office;",
        "(d) incompetence; or",
        "(e) bankruptcy.",
        "(2) A person desiring the removal of a member of a commission or of a holder of an independent office on any ground specified in clause (1) may present a petition to the National Assembly setting out the alleged facts constituting that ground.",
        "(3) The National Assembly shall consider the petition and, if it is satisfied that it discloses a ground under clause (1), shall send the petition to the President.",
        "(4) On receiving a petition under clause (3), the President—",
        "(a) may suspend the member or office holder pending the outcome of the complaint; and",
        "(b) shall appoint a tribunal in accordance with clause (5).",
        "(5) The tribunal shall consist of—",
        "(a) a person who holds or has held office as a judge of a superior court, who shall be the chairperson;",
        "(b) at least two persons who are qualified to be appointed as High Court judges; and",
        "(c) one other member who is qualified to assess the facts in respect of the particular ground for removal.",
        "(6) The tribunal shall investigate the matter expeditiously, report on the facts and make a binding recommendation to the President, who shall act in accordance with the recommendation within thirty days.",
        "(7) A person suspended under this Article is entitled to continue to receive one-half of the remuneration and benefits of the office while suspended.",
        "General functions and powers. "
      ],
      "General functions and powers. ",
      [
        "252. (1) Each commission, and each holder of an independent office— ",
        "(a) may conduct investigations on its own initiative or on a complaint made by a member of the public; ",
        "(b) has the powers necessary for conciliation, mediation and negotiation;",
        "(c) shall recruit its own staff; and",
        "(d) may perform any functions and exercise any powers prescribed by legislation, in addition to the functions and powers conferred by this Constitution.",
        "(2) A complaint to a commission or the holder of an independent office may be made by any person entitled to institute court proceedings under Article 22 (1) and (2).",
        "(3) The following commissions and independent offices have the power to issue a summons to a witness to assist for the purposes of its investigations—",
        "(a) the Kenya National Human Rights and Equality Commission;",
        "(b) the Judicial Service Commission;",
        "(c) the National Land Commission; and",
        "(d) the Auditor-General.",
        "Incorporation of commissions and independent offices."
      ],
      "Incorporation of commissions and independent offices.",
      [
        "253. Each commission and each independent office—",
        "(a) is a body corporate with perpetual succession and a seal; and",
        "(b) is capable of suing and being sued in its corporate name.",
        "Reporting by commissions and independent offices."
      ],
      "Reporting by commissions and independent offices.",
      [
        "254. (1) As soon as practicable after the end of each financial year, each commission, and each holder of an independent office, shall submit a report to the President and to Parliament.",
        "(2) At any time, the President, the National Assembly or the Senate may require a commission or holder of an independent office to submit a report on a particular issue.",
        "(3) Every report required from a commission or holder of an independent office under this Article shall be published and publicised. ",
        "CHAPTER SIXTEEN—AMENDMENT OF THIS CONSTITUTION",
        "Amendment of this Constitution."
      ]
    ]
  ]
]